const PL = 'n, plural, offset:0 ';
export default {
	now: 'ഇപ്പോള്‍',
	minute: `{type, select,
	ago {{${PL}
		=0 {ഇപ്പോള്‍}
		=1 {1 മിനിറ്റിനു മുന്‍പ്}
		other {# മിനിറ്റുകള്‍ക്ക് മുന്‍പ}}}
	agoShort {{${PL}
		=0 {ഇപ്പോള്‍}
		other {# മിനിറ്റുകള്‍ക്ക് മുന്‍പ}}}
	aheadShort {{${PL}
		=0 {കുറച്ചു മുന്‍പ്}
		other {# മിനിറ്റില്‍}}}
	other {{${PL}
		=0 {ഇപ്പോള്‍ കുറച്ചു മുന്‍പ്}
		=1 {1 മിനിറ്റില്‍}
		other {# മിനിറ്റില്‍}}}}`,
	hour: `{type, select,
	ago {{${PL}
		=1 {1 മണിക്കൂറിനു മുന്‍പ്}
		other {# മണിക്കൂറുകള്‍ക്കു മുന്‍പ്}}}
	agoShort {{${PL}
		other {# മണിക്കൂറുകള്‍ക്കു മുന്‍പ്}}}
	aheadShort {{${PL}
		other {# മണിക്കൂറില്‍}}}
	other {{${PL}
		=1 {1 മണിക്കൂറില്‍}
		other {# മണിക്കൂറില്‍}}}}`,
	day: `{type, select,
	ago {{${PL}
		=1 {1 ഒരു ദിവസം മുന്‍പ്}
		other {# ദിവസങ്ങള്‍ക് മുന്‍പ്}}}
	agoShort {{${PL}
		other {# ദിവസങ്ങള്‍ക് മുന്‍പ്}}}
	aheadShort {{${PL}
		other {# ദിവസങ്ങള്‍ക്കുള്ളില്‍}}}
	other {{${PL}
		=1 {1 ദിവസത്തില്‍}
		other {# ദിവസങ്ങള്‍ക്കുള്ളില്‍}}}}`,
	week: `{type, select,
	ago {{${PL}
		=1 {1 ആഴ്ച മുന്‍പ്}
		other {# ആഴ്ചകള്‍ക്ക് മുന്‍പ്}}}
	agoShort {{${PL}
		other {# ആഴ്ചകള്‍ക്ക് മുന്‍പ്}}}
	aheadShort {{${PL}
		other {# ആഴ്ചകള്‍ക്കുള്ളില്‍}}}
	other {{${PL}
		=1 {1 ആഴ്ചയില്‍}
		other {# ആഴ്ചകള്‍ക്കുള്ളില്‍}}}}`,
	month: `{type, select,
	ago {{${PL}
		=1 {1 മാസത്തിനു മുന്‍പ്}
		other {# മാസങ്ങള്‍ക്ക് മുന്‍പ്}}}
	agoShort {{${PL}
		other {# മാസങ്ങള്‍ക്ക് മുന്‍പ്}}}
	aheadShort {{${PL}
		other {# മാസങ്ങള്‍ക്കുള്ളില്‍}}}
	other {{${PL}
		=1 {1 മാസത്തിനുള്ളില്‍}
		other {# മാസങ്ങള്‍ക്കുള്ളില്‍}}}}`,
	year: `{type, select,
	ago {{${PL}
		=1 {1 വര്‍ഷത്തിനു  മുന്‍പ്}
		other {# വര്‍ഷങ്ങള്‍ക്കു മുന്‍പ്}}}
	agoShort {{${PL}
		other {# വര്‍ഷങ്ങള്‍ക്കു മുന്‍പ്}}}
	aheadShort {{${PL}
		other {# വര്‍ഷങ്ങള്‍ക്കുല്ല്ളില്‍}}}
	other {{${PL}
		=1 {in 1 Jahr}
		other {# വര്‍ഷങ്ങള്‍ക്കുല്ല്ളില്‍}}}}`
};
